//Шеф на компания забелязва че все повече служители прекарват  време в сайтове, които ги разсейват. За да предотврати това, той въвежда изненадващи проверки на отворените табове на браузъра на служителите си. Според сайта се налагат различни глоби: "Facebook" -> 150 лв., "Instagram" -> 100 лв., "Reddit" -> 50 лв. От конзолата се четат два реда: Брой отворени табове в браузъра n - цяло число в интервала [1...10], Заплата - число в интервала [700...1500]. След това n – на брой пъти се чете име на уебсайт – текст. Ако по време на проверката заплатата стане по-малка или равна на 0 лева, на конзолата се изписва "You have lost your salary." и програмата приключва. В противен случай след проверката на конзолата се изписва остатъкът от заплатата (да се изпише като цяло число).

function solve(input) {
  let tabs = +input.shift();
  let salary = +input.shift();
  for (let i = 1; i <= tabs; i++) {
    let site = input.shift();
    if (site === "Facebook") {
      salary -= 150;
    } else if (site === "Instagram") {
      salary -= 100;
    } else if (site === "Reddit") {
      salary -= 50;
    }
    if (salary <= 0) {
      break;
    }
  }
  if (salary <= 0) {
    console.log(`You have lost your salary.`);
  } else {
    console.log(salary.toFixed(0));
  }
}
