//В една кинозала столовете са наредени в правоъгълна форма в r реда и c колони. Има три вида прожекции с билети на различни цени: Premiere – премиерна прожекция, на цена 12.00 лева. Normal – стандартна прожекция, на цена 7.50 лева. Discount – прожекция за деца, ученици и студенти на намалена цена от 5.00 лева. Напишете програма, която приема тип прожекция (стринг), брой редове и брой колони в залата (цели числа) и изчислява общите приходи от билети при пълна зала. Резултатът да се отпечата във формат като в примерите по-долу, с 2 знака след десетичната точка.

function solve(input) {
  let projection = input.shift();
  let r = +input.shift();
  let c = +input.shift();
  let income = 0.0;
  switch (projection) {
    case "Premiere":
      income = c * r * 12;
      break;
    case "Normal":
      income = c * r * 7.5;
      break;
    case "Discount":
      income = c * r * 5;
      break;
  }
  console.log(`${income.toFixed(2)} leva`);
}
