//Тони и приятели много обичали да ходят за риба, те са толкова запалени по риболова, че решават да отидат на риболов с кораб. Цената за наема на кораба зависи от сезона и броя рибари. Цената зависи от сезона: Цената за наем на кораба през пролетта е  3000 лв. Цената за наем на кораба през лятото и есента е  4200 лв. Цената за наем на кораба през зимата е  2600 лв. В зависимост от броя си групата ползва отстъпка: Ако групата е до 6 човека включително  –  отстъпка от 10%. Ако групата е от 7 до 11 човека включително  –  отстъпка от 15%. Ако групата е от 12 нагоре  –  отстъпка от 25%. Рибарите ползват допълнително 5% отстъпка ако са четен брой освен ако не е есен - тогава нямат допълнителна отстъпка. Напишете програма, която да пресмята дали рибарите ще съберат достатъчно пари. Сезон –  текст : "Spring", "Summer", "Autumn", "Winter". Да се отпечата на конзолата един ред: Ако бюджетът е достатъчен: "Yes! You have {останалите пари} leva left.". Ако бюджетът НЕ Е достатъчен: "Not enough money! You need {сумата, която не достига} leva.". Сумите трябва да са форматирани с точност до два знака след десетичната запетая.

function solve(input) {
  let budget = +input.shift();
  let season = input.shift();
  let fishermen = +input.shift();
  let price = 0.0;
  if (season == "Spring") {
    price = 3000;
  } else if (season == "Summer" || season == "Autumn") {
    price = 4200;
  } else if (season == "Winter") {
    price = 2600;
  }
  if (fishermen <= 6) {
    price *= 0.9;
  } else if (fishermen >= 7 && fishermen <= 11) {
    price *= 0.85;
  } else if (fishermen >= 12) {
    price *= 0.75;
  }
  if (fishermen % 2 == 0 && season != "Autumn") {
    price *= 0.95;
  }
  if (budget - price >= 0) {
    console.log(`Yes! You have ${(budget - price).toFixed(2)} leva left.`);
  } else {
    console.log(
      `Not enough money! You need ${(price - budget).toFixed(2)} leva.`
    );
  }
}
solve(["3000", "Summer", "11"]);
