//Да се напише програма, в която получава като аргумент вида и размерите на геометрична фигура и пресмята лицето й. Фигурите са четири вида: квадрат (square), правоъгълник (rectangle), кръг (circle) и триъгълник (triangle). На първия ред на входа се чете вида на фигурата (square, rectangle, circle или triangle). Ако фигурата е квадрат, на следващия ред се чете едно число - дължина на страната му. Ако фигурата е правоъгълник, на следващите два реда четат две числа - дължините на страните му. Ако фигурата е кръг, на следващия ред чете едно число - радиусът на кръга. Ако фигурата е триъгълник, на следващите два реда четат две числа - дължината на страната му и дължината на височината към нея. Резултатът да се закръгли до 3 цифри след десетичната точка.

function solve(input) {
    let forma = input.shift();
    let a1 = Number(input.shift());
    let a2 = Number(input.shift());
    if (forma === "square") {
        console.log((a1 * a1).toFixed(3));
    } else if (forma === "rectangle") {
        console.log((a1 * a2).toFixed(3));
    } else if (forma === "circle") {
        console.log(Math.PI * a1 * a1);
    } else if (forma === "triangle") {
        console.log((a1 * a2) / 2);
    }
}
