//Дадено е цяло число – начален брой точки. Върху него се начисляват бонус точки по правилата, описани по-долу. Да се напише програма, която пресмята бонус точките, които получава числото и общия брой точки (числото + бонуса). Ако числото е до 100 включително, бонус точките са 5. Ако числото е по-голямо от 100, бонус точките са 20% от числото. Ако числото е по-голямо от 1000, бонус точките са 10% от числото. Допълнителни бонус точки (начисляват се отделно от предходните): За четно число  + 1 т. За число, което завършва на 5  + 2 т.

function solve(input) {
    let score = +input.shift();
    let bonus = 0.0;
    if (score <= 100) {
        bonus = 5
    } else if (score > 1000) {
        bonus = score * 0.10
    } else {
        bonus = score * 0.20
    }
    if (score % 2 == 0) {
        bonus += 1;
    } else if (score % 10 == 5) {
        bonus += 2;
    }
    console.log(bonus);
    console.log(score + bonus);
}
