//Напишете програма, която пресмята колко общо пари има в сметката, след като направите определен брой вноски. На първия ред ще получите колко вноски трябва да се направят. На всеки следващ ред ще получавате сумата, която трябва да внесете в сметката, докато не се достигне броя вноски. При всяка получена сума на конзолата трябва да се извежда "Increase: " + сумата и тя да се прибавя в сметката. Ако получите число по-малко от 0 на конзолата трябва да се изведе "Invalid operation!" и програмата да приключи. Когато програмата приключи трябва да се принтира "Total: " + общата сума в сметката закръглена до втория знак след десетичната запетая. 

function solve(input) {
  let n = +input.shift();
  let counter = 0;
  let balans = 0.0;
  while (counter < n) {
    let amount = +input.shift();
    if (amount < 0) {
      console.log(`Invalid operation!`);
      break;
    }
    balans += amount;
    console.log(`Increase: ${amount.toFixed(2)}`);
    counter++;
  }
  console.log(`Total: ${balans.toFixed(2)}`);
}
