//Напишете програма, която изчислява средната оценка на ученик от цялото му обучение. На първия ред ще получите името на ученика, а на всеки следващ ред неговите годишни оценки. Ученикът преминава в следващия клас, ако годишната му оценка е по-голяма или равна на 4.00. Ако оценката му е под 4.00, той ще повтори класа. При успешно завършване на 12-ти клас да се отпечата: "{име на ученика} graduated. Average grade: {средната оценка от цялото обучение}". Стойността трябва да бъде форматирана до втория знак след десетичната запетая.

function solve(input) {
  let name = input.shift();
  let count = 1;
  let sum = 0;
  while (count <= 12) {
    let grade = +input.shift();
    if (grade >= 4.0) {
      sum += grade;
      count++;
    }
  }
  let average = sum / 12;
  console.log(`${name} graduated. Average grade: ${average.toFixed(2)}`);
}
